issues/2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-23 Fri 19:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Grolter Bell" />
</head>
<body>
<div id="content">

<div id="outline-container-org48316cc" class="outline-2">
<h2 id="print-read-consistency"><span class="section-number-2">1</span> Issue 2 (PRINT-READ consistency)</h2>
<div class="outline-text-2" id="text-print-read-consistency">
<p>
Lisp reader uses <code>find-package</code> to read a symbol, and is affected by <i>local
nicknames</i> of the <i>current package</i>. So in order to maintain <b>print-read</b>
consistency it is required to use a correct <i>package prefix</i> - such prefix
that calling <code>find-package</code> on it in the <i>current package</i> will return the
symbol's <i>home package</i>.
</p>

<p>
There are several situations to consider:
</p>
<ol class="org-ol">
<li><p>
There <b>is</b> a <i>local nickname</i> defined in the <i>current package</i> for the
symbol's <i>home package</i>.
</p>

<p>
<i>In this case such local nickname can be used as the package prefix.</i>
</p></li>
<li><p>
Symbol's home <i>package name</i> or one of its <i>global nicknames</i> is not
shadowed by any <i>local nickname</i> defined in the <i>current package</i>.
</p>

<p>
<i>In this case that package name or global nickname can be used as the
package prefix.</i>
</p></li>
<li><p>
Symbol's home <i>package name</i> and all its <i>global nicknames</i> are shadowed by
one of the <i>local nicknames</i> of the <i>current package</i> and there <b>is no</b>
<i>local nickname</i> defined (in the <i>current package</i>) for the symbol's home
package.
</p>

<p>
<i>It is not clear what should be done in this case (see proposals).</i>
</p></li>
</ol>
</div>
<div id="outline-container-orgc9f27ad" class="outline-3">
<h3 id="orgc9f27ad"><span class="section-number-3">1.1</span> Example</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-common-lisp">(defpackage #:a (:use) (:export #:+))
(defpackage #:b (:local-nicknames (#:a #:cl)))
(let ((*package* (find-package '#:b)))
  (print 'a:+))
; =&gt; a:+ everywhere
;; but in #:b package a:+ would refer to cl:+
</pre>
</div>
<div class="org-src-container">
<pre class="src src-common-lisp">(defpackage #:a (:use) (:export #:+))
(defpackage #:b (:use) (:export #:+))
(defpackage #:c (:use) (:local-nicknames (#:a #:b) (#:b #:a)))
(let ((*package* (find-package '#:c)))
  (print 'a:+))
; =&gt; b:+  (sbcl, ccl, abcl)
; =&gt; a:+  (clasp, acl, ecl)
;; but in #:c package a:+ would refer to b:+
</pre>
</div>
</div>
</div>
<div id="outline-container-orgecab638" class="outline-3">
<h3 id="orgecab638"><span class="section-number-3">1.2</span> Currently</h3>
<div class="outline-text-3" id="text-1-2">
<p>
sbcl, ccl, abcl: print symbol with package name when all package's names
and nicknames are shadowed by <i>current package</i>'s <i>local nicknames</i>.
</p>

<p>
ecl, acl, clasp: don't print with local nicknames at all.
</p>
</div>
</div>
<div id="outline-container-orgdee75e8" class="outline-3">
<h3 id="orgdee75e8"><span class="section-number-3">1.3</span> Proposals</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><p>
The symbol must be printed using the <code>#.</code> syntax:
</p>
<div class="org-src-container">
<pre class="src src-common-lisp">#.(cl:let ((cl:*package* (cl:find-package "KEYWORD")))
    (cl:find-symbol "BAR" "FOO"))
;; or
#.(cl:let ((cl:*package* (cl:find-package "KEYWORD")))
    (cl:intern "BAR" "FOO"))
</pre>
</div>
<p>
Note that <code>#:KEYWORD</code> name is reserved for the <code>#:KEYWORD</code> package and
cannot be used as a <i>local nickname</i> thus this expression will always
evaluate to the symbol <code>foo::bar</code>.
</p></li>
<li><p>
<i>Shinmera's idea</i>. In this case an extended <code>#:</code> syntax should be used:
</p>
<pre class="example">
#:(package name) and #::(package name)
</pre></li>
<li><p>
In this case the symbol must be printed using the <code>#`</code> syntax for reading
an expression ignoring <i>local nicknames</i> in the <i>current package</i>:
</p>
<pre class="example">
#`foo:bar  and  #`foo::bar
</pre>


<p>
It can be implemented roughly as follows:
</p>
<div class="org-src-container">
<pre class="src src-common-lisp">(defun |#`-reader| (stream subchar arg)
  (declare (ignore subchar arg))
  (let* ((current-package *package*)
         (local-nicknames (package-local-nicknames current-package)))
    (loop for (nick . package) in local-nicknames
          do (remove-package-local-nickname nick current-package))
    (unwind-protect
      (read stream t nil t)
      (loop for (nick . package) in local-nicknames
            do (add-package-local-nickname nick package current-package)))))

(set-dispatch-macro-character #\# #\` #'|#`-reader|)
</pre>
</div>
<p>
It is implementation dependent whether <i>local nicknames</i> are actually
removed from the <i>current package</i> or not.
</p></li>
<li><p>
In this case the symbol must be printed unreadably (specifics are
implementation dependent):
</p>
<pre class="example">
#&lt;SYMBOL IN THE SHADOWED PACKAGE FOO:BAR&gt;
#&lt;SYMBOL IN THE SHADOWED PACKAGE FOO::BAR&gt;
</pre>

<p>
If <code>*print-readably*</code> is <i>true</i> must signal an error of type
<code>print-not-readable</code> without printing anything.
</p></li>
<li><p>
In this case the symbol must be printed using <code>:::</code> and <code>::::</code> syntax
to lookup and intern ignoring <i>local nicknames</i> respectively:
</p>
<div class="org-src-container">
<pre class="src src-common-lisp">foo:::bar  ; same as (cl:find-symbol "BAR" "FOO") in the #:KEYWORD package
foo::::bar  ; same as (cl:intern "BAR" "FOO") in #:KEYWORD package
</pre>
</div></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Grolter Bell</p>
<p class="date">Created: 2023-06-23 Fri 19:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
